================================================================================
Ivar member
================================================================================

module Test
  @foobar: untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (ivar_member
          (ivar_name)
          (type
            (builtin_type)))))))

================================================================================
Alias member
================================================================================

module Test
  alias foo bar
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (alias_member
          (method_name)
          (method_name))))))

================================================================================
Singleton alias member
================================================================================

module Test
  alias self.foo self.bar
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (alias_member
          (singleton_method_name)
          (singleton_method_name))))))

================================================================================
Public visibility member
================================================================================

module Test
  public
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (visibility_member
          (visibility))))))

================================================================================
Private visibility member
================================================================================

module Test
  private
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (visibility_member
          (visibility))))))

================================================================================
attr_reader
================================================================================

module Test
  attr_reader foo: untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (type
            (builtin_type)))))))

================================================================================
attr_reader with ivar name
================================================================================

module Test
  attr_reader foo (@bar): untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (ivar_name)
          (type
            (builtin_type)))))))

================================================================================
attr_reader with no ivar
================================================================================

module Test
  attr_reader foo (): untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (type
            (builtin_type)))))))

================================================================================
attr_writer
================================================================================

module Test
  attr_writer foo: untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (type
            (builtin_type)))))))

================================================================================
attr_writer with ivar name
================================================================================

module Test
  attr_writer foo (@bar): untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (ivar_name)
          (type
            (builtin_type)))))))

================================================================================
attr_writer with no ivar
================================================================================

module Test
  attr_writer foo (): untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (type
            (builtin_type)))))))

================================================================================
attr_accessor
================================================================================

module Test
  attr_accessor foo: untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (type
            (builtin_type)))))))

================================================================================
attr_accessor with ivar name
================================================================================

module Test
  attr_accessor foo (@bar): untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (ivar_name)
          (type
            (builtin_type)))))))

================================================================================
attr_accessor with no ivar
================================================================================

module Test
  attr_accessor foo (): untyped
end

--------------------------------------------------------------------------------

(program
  (module_declaration
    (module_name)
    (members
      (member
        (attribute_member
          (attribute_type)
          (method_name)
          (type
            (builtin_type)))))))
