================================================================================
Single method type
================================================================================

module Test
  def foobar: (String) -> void
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (type
              (builtin_type))))))))

================================================================================
Single method type with required block
================================================================================

module Test
  def foobar: (String) { -> void } -> void
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (block
              (type
                (builtin_type)))
            (type
              (builtin_type))))))))

================================================================================
Single method type with required block with parameters
================================================================================

module Test
  def foobar: (String) { (Integer) -> void } -> void
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (block
              (parameters
                (parameter
                  (type
                    (namespaceable_type
                      (class_name)))))
              (type
                (builtin_type)))
            (type
              (builtin_type))))))))

================================================================================
Single method type with optional block
================================================================================

module Test
  def foobar: (String) ?{ -> void } -> void
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (block
              (type
                (builtin_type)))
            (type
              (builtin_type))))))))

================================================================================
Single method type with optional block with parameters
================================================================================

module Test
  def foobar: (String) ?{ (Integer) -> void } -> void
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (block
              (parameters
                (parameter
                  (type
                    (namespaceable_type
                      (class_name)))))
              (type
                (builtin_type)))
            (type
              (builtin_type))))))))

================================================================================
Multiple method types
================================================================================

module Test
  def foobar: (String) -> void
            | (Integer) { -> void } -> bool
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (type
              (builtin_type)))
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (block
              (type
                (builtin_type)))
            (type
              (builtin_type))))))))

================================================================================
Multiple method types with supertype
================================================================================

module Test
  def foobar: (String) -> void
            | (Integer) -> bool
            | ...
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (type
              (builtin_type)))
          (signature
            (parameters
              (parameter
                (type
                  (namespaceable_type
                    (class_name)))))
            (type
              (builtin_type)))
          (supertype))))))

================================================================================
Single method type with type parameters
================================================================================

module Test
  def foobar: [T] -> Array[T]
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (method_type_parameters
              (type_variable))
            (type
              (namespaceable_type
                (class_name)
                (type_arguments
                  (type
                    (namespaceable_type
                      (class_name))))))))))))

================================================================================
Single method type with bound type parameters
================================================================================

module Test
  def foobar: [T < String] -> Array[T]
end

--------------------------------------------------------------------------------

(program
  (module
    (module_name)
    (members
      (method
        (method_name)
        (method_signatures
          (signature
            (method_type_parameters
              (bound_type
                (type_variable)
                (class_name)))
            (type
              (namespaceable_type
                (class_name)
                (type_arguments
                  (type
                    (namespaceable_type
                      (class_name))))))))))))
